{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 300, 300], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "343_pad", "class_name": "ZeroPadding2D", "config": {"name": "343_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_first"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "343", "class_name": "Conv2D", "config": {"name": "343", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["343_pad", 0, 0, {}]]]}, {"name": "344", "class_name": "BatchNormalization", "config": {"name": "344", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["343", 0, 0, {}]]]}, {"name": "345", "class_name": "Activation", "config": {"name": "345", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["344", 0, 0, {}]]]}, {"name": "346_pad", "class_name": "ZeroPadding2D", "config": {"name": "346_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["345", 0, 0, {}]]]}, {"name": "346", "class_name": "MaxPooling2D", "config": {"name": "346", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["346_pad", 0, 0, {}]]]}, {"name": "347", "class_name": "Conv2D", "config": {"name": "347", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["346", 0, 0, {}]]]}, {"name": "348", "class_name": "BatchNormalization", "config": {"name": "348", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["347", 0, 0, {}]]]}, {"name": "349", "class_name": "Activation", "config": {"name": "349", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["348", 0, 0, {}]]]}, {"name": "350_pad", "class_name": "ZeroPadding2D", "config": {"name": "350_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["349", 0, 0, {}]]]}, {"name": "350", "class_name": "Conv2D", "config": {"name": "350", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["350_pad", 0, 0, {}]]]}, {"name": "351", "class_name": "BatchNormalization", "config": {"name": "351", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["350", 0, 0, {}]]]}, {"name": "352", "class_name": "Activation", "config": {"name": "352", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["351", 0, 0, {}]]]}, {"name": "353", "class_name": "Conv2D", "config": {"name": "353", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["352", 0, 0, {}]]]}, {"name": "355", "class_name": "Conv2D", "config": {"name": "355", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["346", 0, 0, {}]]]}, {"name": "354", "class_name": "BatchNormalization", "config": {"name": "354", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["353", 0, 0, {}]]]}, {"name": "356", "class_name": "BatchNormalization", "config": {"name": "356", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["355", 0, 0, {}]]]}, {"name": "357", "class_name": "Add", "config": {"name": "357", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["354", 0, 0, {}], ["356", 0, 0, {}]]]}, {"name": "358", "class_name": "Activation", "config": {"name": "358", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["357", 0, 0, {}]]]}, {"name": "359", "class_name": "Conv2D", "config": {"name": "359", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["358", 0, 0, {}]]]}, {"name": "360", "class_name": "BatchNormalization", "config": {"name": "360", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["359", 0, 0, {}]]]}, {"name": "361", "class_name": "Activation", "config": {"name": "361", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["360", 0, 0, {}]]]}, {"name": "362_pad", "class_name": "ZeroPadding2D", "config": {"name": "362_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["361", 0, 0, {}]]]}, {"name": "362", "class_name": "Conv2D", "config": {"name": "362", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["362_pad", 0, 0, {}]]]}, {"name": "363", "class_name": "BatchNormalization", "config": {"name": "363", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["362", 0, 0, {}]]]}, {"name": "364", "class_name": "Activation", "config": {"name": "364", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["363", 0, 0, {}]]]}, {"name": "365", "class_name": "Conv2D", "config": {"name": "365", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["364", 0, 0, {}]]]}, {"name": "366", "class_name": "BatchNormalization", "config": {"name": "366", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["365", 0, 0, {}]]]}, {"name": "367", "class_name": "Add", "config": {"name": "367", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["366", 0, 0, {}], ["358", 0, 0, {}]]]}, {"name": "368", "class_name": "Activation", "config": {"name": "368", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["367", 0, 0, {}]]]}, {"name": "369", "class_name": "Conv2D", "config": {"name": "369", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["368", 0, 0, {}]]]}, {"name": "370", "class_name": "BatchNormalization", "config": {"name": "370", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["369", 0, 0, {}]]]}, {"name": "371", "class_name": "Activation", "config": {"name": "371", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["370", 0, 0, {}]]]}, {"name": "372_pad", "class_name": "ZeroPadding2D", "config": {"name": "372_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["371", 0, 0, {}]]]}, {"name": "372", "class_name": "Conv2D", "config": {"name": "372", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["372_pad", 0, 0, {}]]]}, {"name": "373", "class_name": "BatchNormalization", "config": {"name": "373", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["372", 0, 0, {}]]]}, {"name": "374", "class_name": "Activation", "config": {"name": "374", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["373", 0, 0, {}]]]}, {"name": "375", "class_name": "Conv2D", "config": {"name": "375", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["374", 0, 0, {}]]]}, {"name": "376", "class_name": "BatchNormalization", "config": {"name": "376", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["375", 0, 0, {}]]]}, {"name": "377", "class_name": "Add", "config": {"name": "377", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["376", 0, 0, {}], ["368", 0, 0, {}]]]}, {"name": "378", "class_name": "Activation", "config": {"name": "378", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["377", 0, 0, {}]]]}, {"name": "379", "class_name": "Conv2D", "config": {"name": "379", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["378", 0, 0, {}]]]}, {"name": "380", "class_name": "BatchNormalization", "config": {"name": "380", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["379", 0, 0, {}]]]}, {"name": "381", "class_name": "Activation", "config": {"name": "381", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["380", 0, 0, {}]]]}, {"name": "382_pad", "class_name": "ZeroPadding2D", "config": {"name": "382_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["381", 0, 0, {}]]]}, {"name": "382", "class_name": "Conv2D", "config": {"name": "382", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["382_pad", 0, 0, {}]]]}, {"name": "383", "class_name": "BatchNormalization", "config": {"name": "383", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["382", 0, 0, {}]]]}, {"name": "384", "class_name": "Activation", "config": {"name": "384", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["383", 0, 0, {}]]]}, {"name": "385", "class_name": "Conv2D", "config": {"name": "385", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["384", 0, 0, {}]]]}, {"name": "387", "class_name": "Conv2D", "config": {"name": "387", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["378", 0, 0, {}]]]}, {"name": "386", "class_name": "BatchNormalization", "config": {"name": "386", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["385", 0, 0, {}]]]}, {"name": "388", "class_name": "BatchNormalization", "config": {"name": "388", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["387", 0, 0, {}]]]}, {"name": "389", "class_name": "Add", "config": {"name": "389", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["386", 0, 0, {}], ["388", 0, 0, {}]]]}, {"name": "390", "class_name": "Activation", "config": {"name": "390", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["389", 0, 0, {}]]]}, {"name": "391", "class_name": "Conv2D", "config": {"name": "391", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["390", 0, 0, {}]]]}, {"name": "392", "class_name": "BatchNormalization", "config": {"name": "392", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["391", 0, 0, {}]]]}, {"name": "393", "class_name": "Activation", "config": {"name": "393", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["392", 0, 0, {}]]]}, {"name": "394_pad", "class_name": "ZeroPadding2D", "config": {"name": "394_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["393", 0, 0, {}]]]}, {"name": "394", "class_name": "Conv2D", "config": {"name": "394", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["394_pad", 0, 0, {}]]]}, {"name": "395", "class_name": "BatchNormalization", "config": {"name": "395", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["394", 0, 0, {}]]]}, {"name": "396", "class_name": "Activation", "config": {"name": "396", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["395", 0, 0, {}]]]}, {"name": "397", "class_name": "Conv2D", "config": {"name": "397", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["396", 0, 0, {}]]]}, {"name": "398", "class_name": "BatchNormalization", "config": {"name": "398", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["397", 0, 0, {}]]]}, {"name": "399", "class_name": "Add", "config": {"name": "399", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["398", 0, 0, {}], ["390", 0, 0, {}]]]}, {"name": "400", "class_name": "Activation", "config": {"name": "400", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["399", 0, 0, {}]]]}, {"name": "401", "class_name": "Conv2D", "config": {"name": "401", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["400", 0, 0, {}]]]}, {"name": "402", "class_name": "BatchNormalization", "config": {"name": "402", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["401", 0, 0, {}]]]}, {"name": "403", "class_name": "Activation", "config": {"name": "403", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["402", 0, 0, {}]]]}, {"name": "404_pad", "class_name": "ZeroPadding2D", "config": {"name": "404_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["403", 0, 0, {}]]]}, {"name": "404", "class_name": "Conv2D", "config": {"name": "404", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["404_pad", 0, 0, {}]]]}, {"name": "405", "class_name": "BatchNormalization", "config": {"name": "405", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["404", 0, 0, {}]]]}, {"name": "406", "class_name": "Activation", "config": {"name": "406", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["405", 0, 0, {}]]]}, {"name": "407", "class_name": "Conv2D", "config": {"name": "407", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["406", 0, 0, {}]]]}, {"name": "408", "class_name": "BatchNormalization", "config": {"name": "408", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["407", 0, 0, {}]]]}, {"name": "409", "class_name": "Add", "config": {"name": "409", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["408", 0, 0, {}], ["400", 0, 0, {}]]]}, {"name": "410", "class_name": "Activation", "config": {"name": "410", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["409", 0, 0, {}]]]}, {"name": "411", "class_name": "Conv2D", "config": {"name": "411", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["410", 0, 0, {}]]]}, {"name": "412", "class_name": "BatchNormalization", "config": {"name": "412", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["411", 0, 0, {}]]]}, {"name": "413", "class_name": "Activation", "config": {"name": "413", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["412", 0, 0, {}]]]}, {"name": "414_pad", "class_name": "ZeroPadding2D", "config": {"name": "414_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["413", 0, 0, {}]]]}, {"name": "414", "class_name": "Conv2D", "config": {"name": "414", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["414_pad", 0, 0, {}]]]}, {"name": "415", "class_name": "BatchNormalization", "config": {"name": "415", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["414", 0, 0, {}]]]}, {"name": "416", "class_name": "Activation", "config": {"name": "416", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["415", 0, 0, {}]]]}, {"name": "417", "class_name": "Conv2D", "config": {"name": "417", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["416", 0, 0, {}]]]}, {"name": "418", "class_name": "BatchNormalization", "config": {"name": "418", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["417", 0, 0, {}]]]}, {"name": "419", "class_name": "Add", "config": {"name": "419", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["418", 0, 0, {}], ["410", 0, 0, {}]]]}, {"name": "420", "class_name": "Activation", "config": {"name": "420", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["419", 0, 0, {}]]]}, {"name": "421", "class_name": "Conv2D", "config": {"name": "421", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["420", 0, 0, {}]]]}, {"name": "422", "class_name": "BatchNormalization", "config": {"name": "422", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["421", 0, 0, {}]]]}, {"name": "423", "class_name": "Activation", "config": {"name": "423", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["422", 0, 0, {}]]]}, {"name": "424_pad", "class_name": "ZeroPadding2D", "config": {"name": "424_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["423", 0, 0, {}]]]}, {"name": "424", "class_name": "Conv2D", "config": {"name": "424", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["424_pad", 0, 0, {}]]]}, {"name": "425", "class_name": "BatchNormalization", "config": {"name": "425", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["424", 0, 0, {}]]]}, {"name": "426", "class_name": "Activation", "config": {"name": "426", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["425", 0, 0, {}]]]}, {"name": "427", "class_name": "Conv2D", "config": {"name": "427", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["426", 0, 0, {}]]]}, {"name": "429", "class_name": "Conv2D", "config": {"name": "429", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["420", 0, 0, {}]]]}, {"name": "428", "class_name": "BatchNormalization", "config": {"name": "428", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["427", 0, 0, {}]]]}, {"name": "430", "class_name": "BatchNormalization", "config": {"name": "430", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["429", 0, 0, {}]]]}, {"name": "431", "class_name": "Add", "config": {"name": "431", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["428", 0, 0, {}], ["430", 0, 0, {}]]]}, {"name": "432", "class_name": "Activation", "config": {"name": "432", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["431", 0, 0, {}]]]}, {"name": "433", "class_name": "Conv2D", "config": {"name": "433", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["432", 0, 0, {}]]]}, {"name": "434", "class_name": "BatchNormalization", "config": {"name": "434", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["433", 0, 0, {}]]]}, {"name": "435", "class_name": "Activation", "config": {"name": "435", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["434", 0, 0, {}]]]}, {"name": "436_pad", "class_name": "ZeroPadding2D", "config": {"name": "436_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["435", 0, 0, {}]]]}, {"name": "436", "class_name": "Conv2D", "config": {"name": "436", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["436_pad", 0, 0, {}]]]}, {"name": "437", "class_name": "BatchNormalization", "config": {"name": "437", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["436", 0, 0, {}]]]}, {"name": "438", "class_name": "Activation", "config": {"name": "438", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["437", 0, 0, {}]]]}, {"name": "439", "class_name": "Conv2D", "config": {"name": "439", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["438", 0, 0, {}]]]}, {"name": "440", "class_name": "BatchNormalization", "config": {"name": "440", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["439", 0, 0, {}]]]}, {"name": "441", 